[
  {
    "神煞名称": "天乙贵人",
    "核心含义": "至吉之神，一切凶煞的克星。代表权力、地位与庇护。命主遇危难时，能获得有权势、有地位之人的帮助，从而逢凶化吉，遇难呈祥。",
    "年柱": "祖上或父母辈中有贵人，或家境不俗。早年易得长辈、家族的庇护与福荫。",
    "月柱": "兄弟姐妹、朋友、同辈或直属领导是你的贵人。青中年发展时期，易得他人相助，事业顺遂。",
    "日柱": "配偶是你的天乙贵人，或配偶自身条件佳，能给予你巨大帮助。自身具备领导才能与贵气，中年运势亨通。",
    "时柱": "子女有出息且孝顺，下属得力。晚年能得子女、下属的照顾与回报，生活安稳有福。",
    "备注": ""
  },
  {
    "神煞名称": "文昌贵人",
    "核心含义": "主管学识、才华、创造力与考试运。命主通常聪明伶俐，思维敏捷，记忆力强，在学业、考试、文艺创作方面有过人天赋。",
    "年柱": "天生聪慧，悟性高。家族有读书传统，或早年学习环境优越，启蒙较早。",
    "月柱": "青少年时期学业优秀，文采出众，在同学中表现突出。思维活跃，极利于升学、考证等各类考试。",
    "日柱": "自身极具才华与创造力，适合从事文化、艺术、技术类工作。配偶也可能有文采，或中年时期靠才华、技艺立身。",
    "时柱": "晚年仍好学不倦，或热衷于文艺活动。子女聪明有才华，尤其利于子女在文化、教育领域取得成就。",
    "备注": ""
  },
  {
    "神煞名称": "太极贵人",
    "核心含义": "代表对神秘事物、玄学、哲学、宗教有先天悟性和缘分。性格正直专注，喜欢独立思考，有钻研精神，容易在专业领域有所成就。",
    "年柱": "祖上或有信仰、从事偏门、玄学之人。自身天生对神秘事物有好奇心和感知力。",
    "月柱": "青少年时期便展现出对哲学、宗教或特定学科的浓厚兴趣与天赋。易得此类领域的师长指点。",
    "日柱": "自身有强烈的探索精神，适合从事研究、技术、命理、医学等需要深度钻研的工作。",
    "时柱": "晚年对精神世界的追求更甚，可能皈依信仰或深入研究某一门学问。子女也可能对此类领域感兴趣。",
    "备注": ""
  },
  {
    "神煞名称": "月德贵人",
    "核心含义": "五行温和之德，代表仁慈、善良、化解灾厄的力量。是消灾增福的贵人，能逢凶化吉，保佑平安。",
    "年柱": "祖上仁德，家风善良。早年生活平顺，少有病灾，多得长辈慈爱。",
    "月柱": "为人心地善良，乐于助人。在社交圈中人缘好，易得女性长辈或同辈的帮助。",
    "日柱": "自身品行端正，有慈悲心。配偶性格温和，是你的福气来源之一，能化解婚姻中的矛盾。",
    "时柱": "晚年生活安宁慈祥，少病少灾。子女孝顺仁德，能享子女之福。",
    "备注": ""
  },
  {
    "神煞名称": "天德贵人",
    "核心含义": "天地德秀之气，化解灾厄的顶级吉神。能化解一切凶煞、官非，代表天道佑护，一生平安，贵人相助。",
    "年柱": "祖上积德，福泽深厚。一生大灾大难少，总能化险为夷，有\"天佑\"之象。",
    "月柱": "为人正气凛然，受人尊敬。在社会上行事多遇贵人扶持，能化解事业上的重大危机。",
    "日柱": "自身福报深厚，心地善良。是自身的护身符，能保婚姻稳定，配偶有助。",
    "时柱": "晚年福寿双全，德高望重。能庇荫后代，子女事业有成且品行佳。",
    "备注": ""
  },
  {
    "神煞名称": "红鸾",
    "核心含义": "主正式婚姻、恋爱、喜庆之事。为正桃花星，代表婚姻的缔结和明确的恋爱关系。",
    "年柱": "情窦开得早，容易发生童年玩伴或早年相识的恋情。家中易有喜庆之事。",
    "月柱": "青年时期异性缘旺，恋爱机会多，容易通过同辈、朋友介绍结识对象。",
    "日柱": "夫妻宫带红鸾，配偶通常条件佳、富有情趣，自身恋爱结婚意愿强烈。",
    "时柱": "晚年可能仍有情感际遇，或与子女关系融洽，享受天伦之乐。",
    "备注": ""
  },
  {
    "神煞名称": "天喜",
    "核心含义": "红鸾的对星，主订婚、喜庆、生育等一切美好喜悦之事，是强化婚姻结果的吉星。",
    "年柱": "家中早年多喜庆之事，如添丁、贺寿等。自身对爱情有美好憧憬。",
    "月柱": "恋爱过程顺利，易有订婚、结婚之喜。人际关系和谐，多参加聚会喜宴。",
    "日柱": "婚姻生活充满情趣和喜悦，配偶能带来快乐。利于怀孕生育。",
    "时柱": "晚年家庭和睦，子女成家立业，多有弄孙之福。",
    "备注": ""
  },
  {
    "神煞名称": "桃花（咸池）",
    "核心含义": "代表魅力、人缘、情感、艺术感受力。为情欲之星，有时也主才华，视搭配而定吉凶。",
    "年柱": "长得好看，有气质，受人喜爱。早年就容易展现艺术天赋或吸引他人。",
    "月柱": "青年时期人缘极佳，异性缘旺盛，善于交际，是社交圈中的焦点。",
    "日柱": "自身魅力强大，感情丰富，配偶通常外貌出众。但日坐桃花也需防感情困扰、纠缠。",
    "时柱": "晚年仍不乏魅力，子女多半长相好，有艺术才华，在外有好人缘。",
    "备注": ""
  },
  {
    "神煞名称": "驿马",
    "核心含义": "代表变动、迁移、奔波、走动。一生命局多动，或职业多动，或环境多变。",
    "年柱": "祖上或父母有迁移、漂泊的经历。自身早年可能就有离家、变动环境的机会。",
    "月柱": "青少年时期求学、工作多变动，或需要经常出差、奔波。",
    "日柱": "自身好动，不喜静，适合动态工作。配偶可能是外地人，或婚姻生活伴随聚少离多。",
    "时柱": "晚年多出行、旅游，或远赴他乡养老。子女也可能在外地发展。",
    "备注": ""
  },
  {
    "神煞名称": "将星",
    "核心含义": "代表领导才能、权威、组织能力。命主有掌权之能，在团体中容易成为核心人物。",
    "年柱": "祖上或父母有领导能力，或自身在年轻时就展现出管理天赋，能指挥他人。",
    "月柱": "在青中年时期，易成为公司、团队中的管理者，握有实权，下属服从。",
    "日柱": "自身领导力强，不怒自威，能独立创业或掌管一个部门。配偶能力亦强。",
    "时柱": "晚年仍具威望，能指导晚辈。子女有领导才能，能在其领域出人头地。",
    "备注": ""
  },
  {
    "神煞名称": "华盖",
    "核心含义": "代表艺术才华、孤独、宗教哲学缘分。命主聪明孤傲，喜欢独立思考，但易感孤独。",
    "年柱": "天性聪颖但孤僻，与祖上缘分可能较浅，或家族有宗教信仰传统。",
    "月柱": "青年时期不善交际，喜欢钻研技艺、哲学，易与僧道、玄学结缘。",
    "日柱": "自身才华横溢但知音难觅，内心世界丰富而孤独。婚姻中需要精神共鸣。",
    "时柱": "晚年喜静，倾向于精神修养，可能皈依佛道。子女也可能有特殊才华或性情孤独。",
    "备注": ""
  },
  {
    "神煞名称": "孤辰",
    "核心含义": "主性格孤僻、内向、不善交际。男性逢之，易与伴侣产生心理距离。",
    "年柱": "童年性格内向，可能家庭氛围冷清，或与父母沟通少。",
    "月柱": "兄弟姐妹缘薄，朋友少，在团队中感到格格不入，喜欢独处。",
    "日柱": "自身性格孤独，不喜热闹，与配偶沟通不畅，内心有强烈的疏离感。",
    "时柱": "晚年生活较为孤单，子女不在身边或与子女思想差距大。",
    "备注": ""
  },
  {
    "神煞名称": "寡宿",
    "核心含义": "主孤寡、独居、清心寡欲。女性逢之，易与伴侣分离或内心孤寂。",
    "年柱": "家庭观念淡薄，早年生活缺乏温暖，女性长辈或显孤独。",
    "月柱": "同辈亲友少，知心朋友寥寥，喜欢一个人生活，不愿被打扰。",
    "日柱": "婚姻易出问题，如夫妻分居、离异或丧偶。内心倾向于独自生活。",
    "时柱": "晚年多独自生活，喜静，子女缘分较薄，或子女无力陪伴。",
    "备注": ""
  },
  {
    "神煞名称": "亡神",
    "核心含义": "主心神不宁、城府深、官非牢狱。吉则足智多谋，凶则虚耗破败。",
    "年柱": "祖上可能有官非诉讼历史，或自身早年易受惊吓，心神不定。",
    "月柱": "为人机敏但心机深沉，在事业竞争中易卷入是非，需防法律纠纷。",
    "日柱": "配偶心机较重，或自身在婚姻中劳心劳力，精神消耗大。",
    "时柱": "晚年需注意官司诉讼，或为子女之事耗尽心神。",
    "备注": ""
  },
  {
    "神煞名称": "丧门",
    "核心含义": "主孝服、丧事、哀伤。多代表家中亲属有亡故之忧，带来悲伤之事。",
    "年柱": "早年家中易有丧事，多与祖辈、父母辈相关。童年生活带哀伤色彩。",
    "月柱": "青中年时期需注意父母、兄弟姐妹等近亲的健康，易有白事。",
    "日柱": "需格外关注配偶的健康与安全，婚姻生活可能因丧事而蒙上阴影。",
    "时柱": "晚年需注意子女或自身健康，易遭遇晚辈离世的伤痛。",
    "备注": ""
  },
  {
    "神煞名称": "吊客",
    "核心含义": "与丧门类似，主远亲、朋友的丧事，或需前往吊唁的悲伤事件。",
    "年柱": "早年易有远房亲戚或父母的朋辈去世，需参加丧礼。",
    "月柱": "同辈朋友、同事中易有不幸消息传来，带来悲伤情绪。",
    "日柱": "自身的社交圈中易有丧事，或配偶的亲友有亡故之事。",
    "时柱": "晚年易闻听朋友、旧识的噩耗，倍感世事无常。",
    "备注": ""
  },
  {
    "神煞名称": "披麻",
    "核心含义": "主丧事、戴孝，是孝服之象，力量与指向比丧门、吊客更直接。",
    "年柱": "家中必有戴孝之事，多应在直系长辈。",
    "月柱": "父母或同胞兄弟姐妹有灾厄，需穿孝服。",
    "日柱": "自身或配偶需为至亲戴孝，婚姻期间易遇重大丧事。",
    "时柱": "晚年需为晚辈或配偶戴孝，是老年丧亲的明显信号。",
    "备注": ""
  },
  {
    "神煞名称": "建禄",
    "核心含义": "日主在月柱得临官禄地，代表自身强壮、独立性强、精力充沛，但亦主克财，需奔波劳碌致富。",
    "年柱": "只有一个解读（此神煞仅在月柱论，不单独解读年柱）。",
    "月柱": "月柱建禄：身强，独立自主，适合离家发展，白手起家。有强烈的事业心和竞争力。",
    "日柱": "只有一个解读（此神煞仅在月柱论，不单独解读日柱）。",
    "时柱": "只有一个解读（此神煞仅在月柱论，不单独解读时柱）。",
    "备注": "仅月柱有实质解读，其它柱标记为\"只有一个解读\"。"
  },
  {
    "神煞名称": "专禄（归禄）",
    "核心含义": "日主在日支得临官禄地，代表福气深厚、安享富贵、配偶有力，是比建禄更佳的享福之禄。",
    "年柱": "只有一个解读（此神煞主要在日柱论，不单独解读年柱）。",
    "月柱": "只有一个解读（此神煞主要在日柱论，不单独解读月柱）。",
    "日柱": "日坐专禄（如甲寅、乙卯等）：自身气场强，能得一位有能力且帮助自己的配偶，婚姻能带来财富与地位。",
    "时柱": "只有一个解读（此神煞主要在日柱论，不单独解读时柱）。",
    "备注": "仅日柱有实质解读，其它柱标记为\"只有一个解读\"。"
  },
  {
    "神煞名称": "年空亡",
    "核心含义": "年柱地支空亡，称为\"空根\"，代表祖业飘零，与祖上缘分浅薄，早年生活易有缺失。",
    "年柱": "祖上无靠，难以继承祖业。父母对自己的帮助力有限，需自力更生。",
    "月柱": "只有一个解读（此神煞以年柱为主，其它柱不单独解读）。",
    "日柱": "只有一个解读（此神煞以年柱为主，其它柱不单独解读）。",
    "时柱": "只有一个解读（此神煞以年柱为主，其它柱不单独解读）。",
    "备注": "仅年柱为主要落点，其它柱标记为\"只有一个解读\"。"
  },
  {
    "神煞名称": "月空亡",
    "核心含义": "月柱地支空亡，称为\"空兄弟\"，代表兄弟姐妹缘薄，同辈助力少，内心孤独，努力易付诸东流。",
    "年柱": "只有一个解读（此神煞以月柱为主，其它柱不单独解读）。",
    "月柱": "兄弟姐妹少或感情淡薄，难得助力。青中年时期事业根基不稳，多成多败。",
    "日柱": "只有一个解读（此神煞以月柱为主，其它柱不单独解读）。",
    "时柱": "只有一个解读（此神煞以月柱为主，其它柱不单独解读）。",
    "备注": "仅月柱为主要落点，其它柱标记为\"只有一个解读\"。"
  },
  {
    "神煞名称": "日空亡",
    "核心含义": "日柱地支空亡，称为\"空自我\"，代表自身力量不实，心性不定，婚姻不顺，常有空虚之感。",
    "年柱": "只有一个解读（此神煞以日柱为主，其它柱不单独解读）。",
    "月柱": "只有一个解读（此神煞以日柱为主，其它柱不单独解读）。",
    "日柱": "自身才能发挥受限，常怀才不遇。夫妻宫空亡，婚姻易有名无实，或配偶才能难以施展。",
    "时柱": "只有一个解读（此神煞以日柱为主，其它柱不单独解读）。",
    "备注": "仅日柱为主要落点，其它柱标记为\"只有一个解读\"。"
  },
  {
    "神煞名称": "国印贵人",
    "核心含义": "代表权力印信、政府机关、不动产。命主诚实可靠，办事公正，有掌权之机。",
    "年柱": "祖上或在政府部门工作，或家庭与官方、文书打交道多。",
    "月柱": "适合在政府、国企、大机构工作，青中年时期易掌握实权，管理印信。",
    "日柱": "自身有领导能力，为人诚信，能得信任。配偶可能从事公职或管理工作。",
    "时柱": "晚年受人尊敬，有社会地位。子女可能进入公职领域，或从事与法律、文书相关的工作。",
    "备注": ""
  },
  {
    "神煞名称": "天厨贵人",
    "核心含义": "代表食禄、口福、烹饪才能。命主不愁吃穿，懂得享受生活，或有精湛厨艺。",
    "年柱": "祖辈家境殷实，有口福。家庭注重饮食文化。",
    "月柱": "青中年时期生活优渥，多参加宴请，或自己善于烹饪。",
    "日柱": "自身是美食家，喜欢研究吃喝，配偶也可能厨艺佳。",
    "时柱": "晚年生活富足，享受子女或他人的奉养，有口福。",
    "备注": ""
  },
  {
    "神煞名称": "词馆",
    "核心含义": "代表文章出众、学业有成、口才佳。是文昌贵人的一种强化，主在学术、文书方面有极高造诣。",
    "年柱": "天生文采斐然，出口成章。家族有深厚的文化底蕴。",
    "月柱": "学业极佳，尤其在文科方面，易成为学霸，在考试中名列前茅。",
    "日柱": "自身适合从事文学、教育、研究等工作，能以文采立身。",
    "时柱": "晚年仍能著书立说，或教授学问。子女在学业上能有杰出表现。",
    "备注": ""
  },
  {
    "神煞名称": "八专",
    "核心含义": "代表坐拥财禄、情欲旺盛、意志不坚。为淫欲煞，吉则享现成之福，凶则沉迷酒色。",
    "年柱": "祖业丰厚，能得遗产。但自身早年易沉溺于享受，不思进取。",
    "月柱": "青中年时期精力旺盛，但易将精力用于不当之处，需防桃花劫。",
    "日柱": "自身情欲强，配偶体格丰盈。婚姻中需防因情欲问题导致不和。",
    "时柱": "晚年仍不乏桃花，但需注意身体健康，防止过度消耗。",
    "备注": ""
  }
]

